bench/reproducible/results/syscall-20260526T063245Z/raw/kruda-plaintext-handler-perf-warmup.txt
Running 5s test @ http://127.0.0.1:13000/plaintext-handler
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   224.53us  309.23us  13.86ms   98.28%
    Req/Sec   220.46k    45.13k  260.39k    78.71%
  Latency Distribution
     50%  207.00us
     75%  262.00us
     90%  367.00us
     99%  766.00us
  4428968 requests in 5.10s, 549.09MB read
Requests/sec: 868318.52
Transfer/sec:    107.65MB